#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]

#+LaTeX_HEADER: \usepackage[utf8]{inputenc}
#+LaTeX_HEADER: \usepackage[T1,T2A]{fontenc}
#+LaTeX_HEADER: \usepackage[english,russian]{babel}
#+LaTeX_HEADER: \usepackage[unicode]{hyperref}
#+LATEX_HEADER: \hypersetup{colorlinks, citecolor=black, filecolor=black, linkcolor=black, urlcolor=blue}
#+LaTeX_HEADER: \usepackage{amssymb}

* [[http://www.math24.ru/%D0%BA%D0%BE%D0%BC%D0%BF%D0%BB%D0%B5%D0%BA%D1%81%D0%BD%D1%8B%D0%B5-%D1%87%D0%B8%D1%81%D0%BB%D0%B0.html][Комплексные числа]] :noexport:

#+BEGIN_SRC python
result = (3 - 1j)/(2 + 1j) + 1j ** 11 * (-2 + 3j)
# result = (3 - 1j)/(2 + 1j)
# result = 1j ** 11

return result
#+END_SRC

#+RESULTS:
| 4+1j |


* Решим уравнение :noexport:

$$2z^{2} + (5 - 4i)z - 5i = 0$$

#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol
  import cmath

  z = Symbol('z')

  answer = solve(2*z**2 + (5-4j)*z - 5j, z)
  #result = (5 - 4j)*(5 - 4j)
  d = (5 - 4j)**2 - 4*2*(-5j)
  d = cmath.sqrt(d)
  result = (-5 -4j +d)/4
  return answer
#+END_SRC

#+RESULTS:
| -2.0 | + | 1.0*I | -0.5 | + | 1.0*I |

$$2z^{2} + (5 - 4i)z - 5i = 0$$

* Найти все значения

#+BEGIN_SRC python
  from mpmath import *

  result = root(16j,4)

  return result
#+END_SRC

#+RESULTS:
| 1.84775906502257 | + | 0.76536686473018j |

